### Building

```
make
```

### Running

```
# ./gocalc
> 1 + 2
3
> a = 12.3
12.3
> a * 2
24.6
> b = -12.3; c = 2 * b
-12.3
-24.6
> b
-12.3
```
